-- =========================================
-- Задания на дом по SQL
-- Студент: Кирпичников Никита 3ИП-1-24
-- Дата: 29.09.2026
-- =========================================
Задание 1. Самый дорогой товар
SELECT название, цена 
FROM Товар 
ORDER BY цена DESC LIMIT 1;

Задание 2. Самый дешёвый товар
SELECT название, цена
FROM Товар
WHERE цена = (SELECT MIN(цена) FROM Товар);

Задание 3. Товары одной категории
SELECT название, цена
FROM Товар
WHERE категория = 'Розы';

Задание 4. Поиск по названию
SELECT название, цена
FROM Товар
WHERE название LIKE '%о%';

Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество
FROM Заказ;

Задание 6. Заказы конкретного клиента
SELECT id, дата, клиент, товар_id, количество
FROM Заказ
WHERE клиент = 'Иванов Иван Иванович';

Задание 7. JOIN — заказы с названиями товаров
SELECT
   Заказ.дата AS дата,
   Заказ.клиент AS клиент,
   Товар.название AS название_товара,
   Заказ.количество AS количество
FROM Заказ
JOIN Товар ON Заказ.товар_id = товар_id;

Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество) AS общая_сумма
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

Задание 9. Количество заказов по клиентам
 SELECT
   клиент,
   COUNT(*) AS количество_заказов
FROM Заказ
GROUP BY клиент;

Задание 10. Свой запрос
список товаров цена которых >1000 рубликов
SELECT название, цена
FROM Товар
WHERE цена > 1000
ORDER BY цена DESC;
